-- Я хочу дізнатися чи існує рейс між Львовом і Мадридом, і якщо існує то інформацію про нього.

SELECT * FROM Тип_Рейсу 
WHERE (IATA_Code_Аеропорту_прибуття='MAD' AND IATA_Code_Аеропорту_відправлення='LWO')

-- Я хочу взнати зі скількома турецькими аеропортами співпрацює компанія.

SELECT COUNT (Країна) 
From Аеропорти 
WHERE (Країна = 'Туреччина')

-- Я хочу взнати як багато робітників працює на кожній посаді у компанії.

SELECT COUNT ([ID_Працівника]), [ID_Посади]
From Персонал
GROUP BY [ID_Посади]

-- Я хочу дізнатися скільки в розпорядженні компанії знаходиться літаків марки «Боїнг» (мені відомо, що всі літаки марки «Боїнг» мають в кодуванні першою букву “B” і окремо випадок коли мені це не відомо)

SELECT COUNT ([Модель])
FROM [Літаки_компанії]
WHERE ([Модель] LIKE 'B%')

-- Для випадку коли не відомо, що літаки марки "Боїнг" в кодуванні мають першу літеру "В"

SELECT [Літаки_компанії].[ID_Літака], [Модель_літака].[Код_моделі_ICAO], [Модель_літака].[Повна_назва_моделі], [Модель_літака].[Пасажиромісткість]
FROM Модель_літака
RIGHT JOIN [Літаки_компанії] ON [Модель_літака].[Код_моделі_ICAO] = [Літаки_компанії].[Модель] 
WHERE ([Модель_літака].[Повна_назва_моделі] LIKE 'BOEING%')

-- Компанія планує прокласти новий маршрут. Для цього потрібно підібрати і такі моделі літаків в яких пасажиромісткість не менше 500 людей 

SELECT [Літаки_компанії].[ID_Літака], [Модель_літака].[Код_моделі_ICAO], [Модель_літака].[Повна_назва_моделі], [Модель_літака].[Пасажиромісткість]
FROM Модель_літака
RIGHT JOIN [Літаки_компанії] ON [Модель_літака].[Код_моделі_ICAO] = [Літаки_компанії].[Модель] 
WHERE ([Модель_літака].[Пасажиромісткість] > 500)

-- Я хочу дізнатись який з літаків компанії має найбільший можливий запас палива 
-- Якщо просто необхідно взнати максимальний запас палива 
SELECT MAX ([Запас_палива])
FROM [dbo].[Модель_літака]

-- Якщо необхідно взнати конкретно модель і літак 

SELECT TOP 1 [Літаки_компанії].[ID_Літака], [Модель_літака].[Код_моделі_ICAO], [Модель_літака].[Повна_назва_моделі], [Модель_літака].[Запас_палива]
FROM [Літаки_компанії]
LEFT JOIN [Модель_літака] ON [Модель_літака].[Код_моделі_ICAO] = [Літаки_компанії].[Модель] 
ORDER BY [Запас_палива] DESC

-- Необхідно порахувати скільки бортпровідниць мають більше ніж 3 вильоти у поточному тижні 
SELECT [Бортпровідниця]
FROM Політ
GROUP BY [Бортпровідниця]
HAVING COUNT ([Бортпровідниця]) > 3
 

 --Недавно хтось намагався взламати базу даних з особистою інформацієї працівників. Необхідно створити запасну таблицю з персональною інформацією усіх працівників компанії на випадок якщо вона буде пошкоджена під час можливої атаки.

SELECT * INTO CustomersBackup2017
FROM [dbo].[Персонал]
WHERE (ID_Посади BETWEEN 10 AND 20)